app/helpers/user_shops_helper.rb

SELECT MAX("user_shops"."created_at") FROM "user_shops" WHERE "user_shops"."users_id" = ?  [["users_id", 1]]
SELECT "user_shops".* FROM "user_shops" WHERE "user_shops"."users_id" = ? AND "user_shops"."created_at" = ?  [["users_id", 1], ["created_at", "2022-05-07 10:11:03.765708"]]
---
    def current_User_Shop
        userShop = UserShop.where(users_id: get_user_id)
        lastCreateDate = userShop.maximum(:created_at)
        return userShop.where(created_at: lastCreateDate)[0]