app/controllers/login_controller.rb

  def create
    if params[:isLogin]
        # @hashpassword =
        user = User.find_by(name: params[:name], password: params[:password])
---
SELECT "users".* FROM "users" WHERE "users"."name" = ? AND "users"."password" = ? LIMIT ?  [["name", "123"], ["password", "1"], ["LIMIT", 1]]