app/controllers/papers_controller.rb

SELECT "customers".* FROM "customers" WHERE "customers"."paper_id" = ? LIMIT ?  [["paper_id", 38], ["LIMIT", 1]]
---
    def show
        render json: { status: :ok, data: Paper.find(params[:id]).as_json(include: [:customer, :items, :user_shop]) }

SELECT "papers".* FROM "papers" INNER JOIN "items" ON "items"."papers_id" = "papers"."id" WHERE "papers"."users_id" = ? ORDER BY "papers"."id" ASC LIMIT ?  [["users_id", 1], ["LIMIT", 1]]
SELECT "papers".* FROM "papers" WHERE "papers"."users_id" = ? AND "papers"."paper_type" = ?  [["users_id", 1], ["paper_type", "quotation"]]
SELECT COUNT(*) FROM "papers" WHERE "papers"."users_id" = ?  [["users_id", 1]]
---
    def pagination
        if(params[:page] & params[:results])
            all = Paper.where(users_id: helpers.get_user_id).where(is_deleted: [nil, false])
            # filter
            if(params[:paper_type])
                all = all.where(paper_type: params[:paper_type])
            end
            if(params[:price_unit])
                all = all.where(price_unit: params[:price_unit])
            end
            if(params[:name])
                all = all.where("name like ?", "%#{params[:name][0]}%")
            end

            all = all.includes(:items)

            papers = nil
            # sort
            if(params[:sortField])
                papers = all.order(params[:sortField] + (params[:sortOrder] == "ascend" ? "" : " DESC")).first(params[:results] * params[:page]).last(10)
            else
                papers = all.last(params[:results] * params[:page]).first(10).reverse()