app/controllers/papers_controller.rb

SELECT "papers".* FROM "papers"
---
    def index
        papers = Paper.all

SELECT "items".* FROM "items" WHERE "items"."papers_id" IN (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "papers".* FROM "papers" WHERE "papers"."users_id" = ? ORDER BY "papers"."id" DESC LIMIT ?  [["users_id", 1], ["LIMIT", 10]]
SELECT "papers".* FROM "papers" WHERE "papers"."users_id" = ? AND "papers"."paper_type" = ? ORDER BY "papers"."id" DESC LIMIT ?  [["users_id", 1], ["paper_type", "quotation"], ["LIMIT", 10]]
SELECT "papers".* FROM "papers" WHERE "papers"."users_id" = ? AND "papers"."price_unit" = ? ORDER BY "papers"."id" DESC LIMIT ?  [["users_id", 1], ["price_unit", "sgd"], ["LIMIT", 10]]
SELECT "items".* FROM "items" WHERE "items"."papers_id" = ?  [["papers_id", 1]]
SELECT COUNT(*) FROM "papers" WHERE "papers"."users_id" = ? AND "papers"."price_unit" = ?  [["users_id", 1], ["price_unit", "rm"]]
SELECT "items".* FROM "items" WHERE "items"."paper_id" = ?  [["paper_id", 56]]
SELECT "papers".* FROM "papers" INNER JOIN "customers" ON "customers"."id" = "papers"."customers_id" WHERE "papers"."users_id" = ?  [["users_id", 1]]
SELECT "items".* FROM "items" WHERE "items"."papers_id" = ?  [["papers_id", 52]]
SELECT "papers".* FROM "papers" WHERE "papers"."users_id" = ? AND (name like '%["3"]%') ORDER BY "papers"."id" DESC LIMIT ?  [["users_id", 1], ["LIMIT", 10]]
SELECT COUNT(*) FROM "papers" WHERE "papers"."users_id" = ?  [["users_id", 1]]
SELECT "items".* FROM "items" WHERE "items"."papers_id" = ?  [["papers_id", 40]]
---
    def pagination
        if(params[:page] & params[:results])
            all = Paper.where(users_id: helpers.get_user_id).includes(:items)
            # filter
            if(params[:paper_type])
                all = all.where(paper_type: params[:paper_type])
            end
            if(params[:price_unit])
                all = all.where(price_unit: params[:price_unit])
            end
            if(params[:name])
                all = all.where("name like ?", "%#{params[:name][0]}%")
            end

            papers = nil

            # sort
            if(params[:sortField])
                papers = all.order(params[:sortField] + (params[:sortOrder] == "ascend" ? "" : " DESC")).first(params[:results] * params[:page]).last(10)
            else
                papers = all.last(params[:results] * params[:page]).first(10).reverse()
            end

            papers.each do |paper|
                total_price = 0
                paper.items.each do |item|

INSERT INTO "customers" ("name", "address", "phone", "created_at", "updated_at", "users_id") VALUES (?, ?, ?, ?, ?, ?)  [["name", "123"], ["address", "456"], ["phone", "7890"], ["created_at", "2022-05-08 11:26:17.532396"], ["updated_at", "2022-05-08 11:26:17.532396"], ["users_id", 1]]
INSERT INTO "papers" ("name", "paper_type", "price_unit", "discount", "deposit", "created_at", "updated_at", "users_id", "user_shops_id", "customers_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
DELETE FROM "papers" WHERE "papers"."id" = ?  [["id", 48]]
INSERT INTO "customers" ("name", "address", "phone", "created_at", "updated_at", "users_id") VALUES (?, ?, ?, ?, ?, ?)  [["name", "123"], ["address", "456"], ["phone", "7890"], ["created_at", "2022-05-08 15:35:42.957539"], ["updated_at", "2022-05-08 15:35:42.957539"], ["users_id", 1]]
SELECT "customers".* FROM "customers" WHERE "customers"."papers_id" = ? LIMIT ?  [["papers_id", 88], ["LIMIT", 1]]
SELECT "user_shops".* FROM "user_shops" WHERE "user_shops"."users_id" = ? AND "user_shops"."created_at" = ?  [["users_id", 1], ["created_at", "2022-05-07 10:21:26.624518"]]
SELECT MAX("user_shops"."created_at") FROM "user_shops" WHERE "user_shops"."users_id" = ?  [["users_id", 1]]
SELECT "items".* FROM "items" WHERE "items"."papers_id" = ?  [["papers_id", 24]]
INSERT INTO "items" ("description", "unit_price", "unit", "sort_id", "created_at", "updated_at", "papers_id", "users_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
    def create
        paper = Paper.new(helpers.object_with_user_id(paper_params))
        paper.user_shop = helpers.current_User_Shop

        # customer
        customer = params.permit(customer: [:name, :address, :phone])[:customer]
        paper.create_customer(helpers.object_with_user_id(customer))
        if !paper.customer.valid?
            return_valid_fail_json(paper.customer)
            paper.destroy
            return
        end

        if paper.valid? & paper.save
            # items
            items = params.permit(items: [:sort_id, :description, :unit_price, :unit])[:items]
            items.each_with_index do |item, index| items[index] = helpers.object_with_user_id(item) end

            paper.items.new(items)
            paper.items.each do |item|
                if !item.valid? & item.save