app/controllers/papers_controller.rb

SELECT COUNT(*) FROM "papers" WHERE "papers"."user_id" = ?  [["user_id", 1]]
INSERT INTO "papers" ("name", "user_id", "paper_type", "price_unit", "discount", "deposit", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
INSERT INTO "items" ("description", "unit_price", "unit", "sort_id", "paper_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["description", "1"], ["unit_price", "2"], ["unit", "3"], ["sort_id", 0], ["paper_id", 55], ["created_at", "2022-05-05 14:50:44.335240"], ["updated_at", "2022-05-05 14:50:44.335240"]]
INSERT INTO "papers" ("name", "price_unit", "discount", "deposit", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "2022-5-5~18.32.58"], ["price_unit", "rm"], ["discount", "0.00"], ["deposit", "8.00"], ["created_at", "2022-05-05 10:32:59.722673"], ["updated_at", "2022-05-05 10:32:59.722673"]]
DELETE FROM "papers" WHERE "papers"."id" = ?  [["id", 86]]
INSERT INTO "items" ("description", "unit_price", "unit", "sort_id", "paper_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["description", "1"], ["unit_price", "2"], ["unit", "3"], ["sort_id", 0], ["paper_id", 22], ["created_at", "2022-05-05 10:32:59.749929"], ["updated_at", "2022-05-05 10:32:59.749929"]]
INSERT INTO "customers" ("name", "address", "phone", "user_id", "paper_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", "123"], ["address", "456"], ["phone", "7890"], ["user_id", 1], ["paper_id", 107], ["created_at", "2022-05-06 07:20:02.285573"], ["updated_at", "2022-05-06 07:20:02.285573"]]
INSERT INTO "papers" ("name", "paper_type", "price_unit", "discount", "deposit", "created_at", "updated_at", "users_id", "user_shops_id", "customers_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
DELETE FROM "papers" WHERE "papers"."id" = ?  [["id", 89]]
---
    def create
        if(params[:page] & params[:results])
            # for get with pagination
            # todo
            papers = Paper.where(user_id: get_user_id)
            render json: { status: :ok, data: papers, detail: { total: papers.count } }
        else
            paper = Paper.new(object_with_user_id(paper_params))

            if paper.save
                begin
                    items = params.permit(items: [:sort_id, :description, :unit_price, :unit])[:items]
                    items.each do |item| object_with_user_id(item) end

                    paper.items.create(items)

                    if !paper.items.all?(&:valid?)
                        paper.destroy
                        render json: { errors: "fail to create data" }, status: 404
                        return
                    end

                    customer = params.permit(customer: [:name, :address, :phone])[:customer]
                    paper.create_customer(object_with_user_id(customer))

                    if !paper.customer.valid?
                        paper.destroy