app/controllers/user_shops_controller.rb

SELECT "user_shops".* FROM "user_shops"
---
    def index
        render json: { status: :ok, data: UserShop.all }

SELECT MAX("user_shops"."created_at") FROM "user_shops" WHERE "user_shops"."users_id" = ?  [["users_id", 1]]
SELECT "user_shops".* FROM "user_shops" WHERE "user_shops"."users_id" = ?  [["users_id", 2]]
SELECT "user_shops".* FROM "user_shops" WHERE "user_shops"."users_id" = ? AND "user_shops"."created_at" = ?  [["users_id", 1], ["created_at", "2022-05-06 09:01:38.607914"]]
SELECT MAX("user_shops"."created_at") FROM "user_shops" WHERE "user_shops"."user_id" = ?  [["user_id", 1]]
---
    def show
        userShop = UserShop.where(users_id: get_user_id)
        lastCreateDate = userShop.maximum(:created_at)
        render json: { status: :ok, data: userShop.where(created_at: lastCreateDate)[0] }

SELECT "user_shops".* FROM "user_shops" WHERE "user_shops"."users_id" = ? AND "user_shops"."created_at" = ?  [["users_id", 1], ["created_at", "2022-05-06 09:50:13.667115"]]
SELECT MAX("user_shops"."created_at") FROM "user_shops" WHERE "user_shops"."users_id" = ?  [["users_id", 1]]
SELECT COUNT(*) FROM "user_shops" WHERE "user_shops"."users_id" = ?  [["users_id", 1]]
SELECT "user_shops".* FROM "user_shops" WHERE "user_shops"."users_id" = ? AND "user_shops"."created_at" = ?  [["users_id", 1], ["created_at", "2022-05-06 10:12:59.228756"]]
SELECT "user_shops".* FROM "user_shops" WHERE "user_shops"."users_id" = ? AND "user_shops"."created_at" = ?  [["users_id", 1], ["created_at", "2022-05-06 10:00:24.526601"]]
INSERT INTO "user_shops" ("name", "address", "ssm", "boss_name", "boss_phone", "nick_name", "created_at", "updated_at", "users_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
    def create
        userShop = UserShop.where(users_id: get_user_id)

        # only check if have record
        if userShop.count != 0
            lastCreateDate = userShop.maximum(:created_at)
            userShop = userShop.where(created_at: lastCreateDate)[0]
            userShop = userShop.as_json.keep_if {|k, v| ["name", "address", "ssm", "boss_name", "boss_phone", "nick_name"].include?(k)}

            if user_shop_params == userShop
                render json: { errors: "Don't update shop with same data" }, status: 422
                return
            end
        end

        shop = UserShop.new(object_with_user_id(user_shop_params))

        if  shop.valid? & shop.save