app/controllers/user_shops_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
    def create
        userShop = UserShop.where(users_id: helpers.get_user_id)

        # only check if have record
        if !helpers.current_User_Shop.nil?
            userShop = helpers.current_User_Shop.as_json.keep_if {|k, v| ["name", "address", "ssm", "boss_name", "boss_phone", "nick_name"].include?(k)}