app/controllers/user_shop_controller.rb

SELECT "user_shops".* FROM "user_shops"
---
    def index
        render json: { status: :ok, data: UserShop.all }

SELECT "user_shops".* FROM "user_shops" WHERE "user_shops"."user_id" = ? AND "user_shops"."created_at" = ?  [["user_id", 1], ["created_at", "2022-05-03 14:48:11.189481"]]
SELECT MAX("user_shops"."created_at") FROM "user_shops" WHERE "user_shops"."user_id" = ?  [["user_id", 1]]
SELECT "user_shops".* FROM "user_shops" WHERE "user_shops"."user_id" = ? AND "user_shops"."created_at" = ?  [["user_id", 1], ["created_at", "2022-05-03 16:29:27.188710"]]
SELECT "user_shops".* FROM "user_shops" WHERE "user_shops"."user_id" = ? AND "user_shops"."created_at" = ?  [["user_id", 1], ["created_at", "2022-05-03 15:05:42.937807"]]
---
    def show
        userShop = UserShop.where(user_id: params[:id])
        lastCreateDate = userShop.maximum(:created_at)
        render json: { status: :ok, data: userShop.where(created_at: lastCreateDate)[0] }

INSERT INTO "user_shops" ("name", "address", "ssm", "boss_name", "boss_phone", "user_id", "nick_name", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
    def create
        user = UserShop.create(user_shop_params)

SELECT "user_shops".* FROM "user_shops" WHERE (1) LIMIT ?  [["LIMIT", 1]]
---
    def set_user_shop
        @shop = UserShop.find_by(params[:id])